app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "author", "body", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Cześć!"], ["author", "Monika"], ["body", "Jestem Monia! ;)"], ["published", "t"], ["created_at", "2018-01-15 18:32:31.229106"], ["updated_at", "2018-01-15 18:32:31.229106"]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Hello"], ["body", "To jest super wygodne!\r\n\r\nTak trzymać."], ["updated_at", "2018-01-16 15:52:59.951658"], ["id", 8]]

  def published
    @posts = Post.where(published: true)
---
SELECT "posts".* FROM "posts" WHERE "posts"."published" = ?  [["published", "t"]]

  def confirm_destroy
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]